In [1]:
import numpy as np 
import pandas as pd

2번

In [2]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

A

In [5]:
titanic["category1"] = titanic.apply(lambda r: r.sex if r.age >= 20 else "child", axis=1)
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,child
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,male
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,child
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,female
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,child

B

In [10]:
# 나이 평균
titanic["age"].mean()

29.69929292929302

In [7]:
titanic["age"] = titanic["age"].fillna(titanic["age"].mean()).round(2)
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
5,0,3,male,29.7,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,child
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,male
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,child
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,female
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,child

C

In [55]:
survived_count = titanic["survived"].count()
survived_count

891

In [33]:
#alive_count = titanic['survived'].sum()
#live_count

342

In [21]:
#생존률
#전체 살은 승객수 31= 891     
#살은사람 생존수 33= 342

In [50]:
#df = titanic.groupby(["sex", "alive",]).count()/alive_count
#df

              survived    pclass       age     sibsp     parch      fare  \
sex    alive
female no     0.236842  0.236842  0.236842  0.236842  0.236842  0.236842
       yes    0.681287  0.681287  0.681287  0.681287  0.681287  0.681287
male   no     1.368421  1.368421  1.368421  1.368421  1.368421  1.368421
       yes    0.318713  0.318713  0.318713  0.318713  0.318713  0.318713

              embarked     class       who  adult_male      deck  embark_town  \
sex    alive
female no     0.236842  0.236842  0.236842    0.236842  0.017544     0.236842
       yes    0.675439  0.681287  0.681287    0.681287  0.266082     0.675439
male   no     1.368421  1.368421  1.368421    1.368421  0.178363     1.368421
       yes    0.318713  0.318713  0.318713    0.318713  0.131579     0.318713

                 alone  category1  total_people   r_alive
sex    alive
female no     0.236842   0.236842      0.236842  0.236842
       yes    0.681287   0.681287      0.681287  0.681287
male   no     1.368421   1.368421      1.368421  1.368421
       yes    0.318713   0.318713      0.318713  0.318713

In [51]:
#df1 = titanic.groupby(["sex", "alive"]).count()/survived_count
#df1

              survived    pclass       age     sibsp     parch      fare  \
sex    alive
female no     0.090909  0.090909  0.090909  0.090909  0.090909  0.090909
       yes    0.261504  0.261504  0.261504  0.261504  0.261504  0.261504
male   no     0.525253  0.525253  0.525253  0.525253  0.525253  0.525253
       yes    0.122334  0.122334  0.122334  0.122334  0.122334  0.122334

              embarked     class       who  adult_male      deck  embark_town  \
sex    alive
female no     0.090909  0.090909  0.090909    0.090909  0.006734     0.090909
       yes    0.259259  0.261504  0.261504    0.261504  0.102132     0.259259
male   no     0.525253  0.525253  0.525253    0.525253  0.068462     0.525253
       yes    0.122334  0.122334  0.122334    0.122334  0.050505     0.122334

                 alone  category1  total_people   r_alive
sex    alive
female no     0.090909   0.090909      0.090909  0.090909
       yes    0.261504   0.261504      0.261504  0.261504
male   no     0.525253   0.525253      0.525253  0.525253
       yes    0.122334   0.122334      0.122334  0.122334

In [56]:
df2 = titanic.groupby(["sex", "class","embark_town"])[["survived"]].count()/survived_count
df2

                           survived
sex    class  embark_town
female First  Cherbourg    0.048260
              Queenstown   0.001122
              Southampton  0.053872
       Second Cherbourg    0.007856
              Queenstown   0.002245
              Southampton  0.075196
       Third  Cherbourg    0.025814
              Queenstown   0.037037
              Southampton  0.098765
male   First  Cherbourg    0.047138
              Queenstown   0.001122
              Southampton  0.088664
       Second Cherbourg    0.011223
              Queenstown   0.001122
              Southampton  0.108866
       Third  Cherbourg    0.048260
              Queenstown   0.043771
              Southampton  0.297419

In [41]:
#df_sex= titanic.groupby(["sex","alive"])[["alive"]].count()
#df_sex

              alive
sex    alive
female no        81
       yes      233
male   no       468
       yes      109

In [45]:
#titanic.groupby(["sex", "alive"]).size()

sex     alive
female  no        81
        yes      233
male    no       468
        yes      109
dtype: int64

In [59]:
df_sex1= titanic.groupby(["sex","survived"])[["survived"]].count()
df_sex1

                 survived
sex    survived
female 0               81
       1              233
male   0              468
       1              109

In [60]:
#성별 생존률 
#female_alive = 81/alive_count
#male_alive = 109 / alive_count

In [42]:
df_class= titanic.groupby(["class","alive"])[["alive"]].count()
df_class

              alive
class  alive
First  no        80
       yes      136
Second no        97
       yes       87
Third  no       372
       yes      119

In [44]:
df_town= titanic.groupby(["embark_town","alive"])[["alive"]].count()
df_town

                   alive
embark_town alive
Cherbourg   no        75
            yes       93
Queenstown  no        47
            yes       30
Southampton no       427
            yes      217

In [28]:
titanic.pivot_table("embark_town", "sex", "class", aggfunc="count", margins=True)

class   First  Second  Third  All
sex
female     92      76    144  312
male      122     108    347  577
All       214     184    491  889

In [ ]:
#성별 생존률 여자 312/전체 342명 ,남자 577
#선실별
#출발지별